src/CF/Catalogs/Поставщики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Поставщики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Клиенты</xr:Item>
				<xr:Item>Catalog.Производители</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравовойСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравовойСтатус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Поставщики/Ext/ObjectModule.bsl
//sza140118-1638 
//sza130915-1735 : 

Процедура ПередЗаписью(Отказ)
	
	Если не ЭтоГруппа 
		и Модифицированность() ТОгда
		
		Если НЕ ЗначениеЗаполнено(НаименованиеДляПечати) Тогда
			НаименованиеДляПечати = Наименование;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Родитель) 
			и ЗначениеЗаполнено(Родитель.ВидЦен)
			и (не ЗначениеЗаполнено(ВидЦен) или ВидЦен <> Родитель.ВидЦен) Тогда
			
			ВидЦен = Родитель.ВидЦен;
		КонецЕсли;
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьОКПО(Отказ, "Поставщики", ЭтотОбъект.ОКПО, ЭтотОбъект.Ссылка);		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "Поставщики", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);

	ИначеЕсли Модифицированность() тогда
		
		Если НЕ Отказ 
			И ЗначениеЗаполнено(Ссылка)
			И ЗначениеЗаполнено(ВидЦен) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ Поставщики.Ссылка
			|ИЗ Справочник.Поставщики КАК Поставщики
			|ГДЕ Поставщики.Родитель = &Родитель И Поставщики.ВидЦен <> &ВидЦен";
			
			Запрос.УстановитьПараметр("Родитель", Ссылка);
			Запрос.УстановитьПараметр("ВидЦен", ВидЦен);  			
			
			РезультатЗапроса = Запрос.Выполнить();
			если не РезультатЗапроса.Пустой() тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Счетчик  = 0;
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ПоставщикОбъект = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
					ПоставщикОбъект.ВидЦен = ВидЦен;
					ПоставщикОбъект.Записать();
					Счетчик = Счетчик  + 1;
				КонецЦикла;
				
				Если не Счетчик =0 Тогда
					если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вид цен установлен для") + " " + Счетчик + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Поставщиков этой группы."), , ссылка);
						//Сообщение = Новый СообщениеПользователю;
						//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вид цен установлен для") + " " + Счетчик + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Поставщиков этой группы.");
						//Сообщение.Сообщить();                                               	
					КонецЕсли;
					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		ВидЦен = ДанныеЗаполнения.ВидЦен;
		Комментарий = ДанныеЗаполнения.Комментарий;
		МФО = ДанныеЗаполнения.МФО;
		Наименование = ДанныеЗаполнения.Наименование;
		НаименованиеБанка = ДанныеЗаполнения.НаименованиеБанка;
		НаименованиеДляПечати = ДанныеЗаполнения.НаименованиеДляПечати;
		НомерСчета = ДанныеЗаполнения.НомерСчета;
		ОКПО = ДанныеЗаполнения.ОКПО;
		ОсновнаяВалюта = ДанныеЗаполнения.ОсновнаяВалюта;
		ПравовойСтатус = ДанныеЗаполнения.ПравовойСтатус;
		Регион = ДанныеЗаполнения.Регион;
		Склад = ДанныеЗаполнения.Склад;
		Телефон = ДанныеЗаполнения.Телефон;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
		ЭтоСотрудник = ДанныеЗаполнения.ЭтоСотрудник;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Производители") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Регион = ДанныеЗаполнения.Регион;
		Производитель = ДанныеЗаполнения.Ссылка;
		Телефон = ДанныеЗаполнения.Телефон;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОКПО = ДанныеЗаполнения.ОКПО;
		Телефон = ДанныеЗаполнения.Телефон;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
		ЭтоСотрудник = Истина;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
